In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

import warnings
warnings.filterwarnings('ignore')

In [2]:
da = pd.read_csv("h1bDataAnalyst.csv", index_col=0)
ds = pd.read_csv("h1bDataScientist.csv", index_col=0)
se = pd.read_csv("h1bSoftwareEngineer.csv", index_col=0)

In [3]:
da = da[da.submitYear>2014]
ds = ds[ds.submitYear>2014]
se = se[se.submitYear>2014]

In [4]:
ds.title.unique()

array(['ASSOCIATE DATA SCIENTIST', 'DATA SCIENTIST',
       'STAFF DATA SCIENTIST', 'SENIOR DATA SCIENTIST',
       'PRINCIPAL DATA SCIENTIST', 'LEAD DATA SCIENTIST',
       'DATA SCIENTIST 1', 'DATA SCIENTIST 2', 'DATA SCIENTIST 3',
       'DATA SCIENTIST I', 'DATA SCIENTIST II', 'DATA SCIENTIST III',
       'JUNIOR DATA SCIENTIST'], dtype=object)

In [5]:
ds_title_map = {
    'JUNIOR DATA SCIENTIST':'Junior Data Scientist',
    'ASSOCIATE DATA SCIENTIST':'Associate Data Scientist',
    'DATA SCIENTIST':'Data Scientist',
    'SENIOR DATA SCIENTIST':'Senior Data Scientist',
    'STAFF DATA SCIENTIST':'Staff Data Scientist',
    'PRINCIPAL DATA SCIENTIST':'Principal Data Scientist',
    'LEAD DATA SCIENTIST':'Lead Data Scientist',
    'DATA SCIENTIST 1':'Associate Data Scientist', 
    'DATA SCIENTIST 2':'Data Scientist', 
    'DATA SCIENTIST 3':'Senior Data Scientist',
    'DATA SCIENTIST I':'Associate Data Scientist',
    'DATA SCIENTIST II':'Data Scientist',
    'DATA SCIENTIST III':'Senior Data Scientist'
}

In [6]:
ds['title'] = ds['title'].map(ds_title_map)

In [7]:
ds['title'].unique()

array(['Associate Data Scientist', 'Data Scientist',
       'Staff Data Scientist', 'Senior Data Scientist',
       'Principal Data Scientist', 'Lead Data Scientist',
       'Junior Data Scientist'], dtype=object)

In [8]:
se.title.unique()

array(['JUNIOR SOFTWARE ENGINEER', 'ASSOCIATE SOFTWARE ENGINEER',
       'SOFTWARE ENGINEER', 'SENIOR SOFTWARE ENGINEER',
       'STAFF SOFTWARE ENGINEER', 'PRINCIPAL SOFTWARE ENGINEER',
       'LEAD SOFTWARE ENGINEER', 'SOFTWARE ENGINEER 1',
       'SOFTWARE ENGINEER 2', 'SOFTWARE ENGINEER 3',
       'SOFTWARE ENGINEER I', 'SOFTWARE ENGINEER II',
       'SOFTWARE ENGINEER III'], dtype=object)

In [9]:
se_title_map ={
    "JUNIOR SOFTWARE ENGINEER":"Junior Software Engineer",
    "ASSOCIATE SOFTWARE ENGINEER":"Associate Software Engineer",
    "SOFTWARE ENGINEER":"Software Engineer", 
    "SENIOR SOFTWARE ENGINEER":"Senior Software Engineer",
    "STAFF SOFTWARE ENGINEER":"Staff Software Engineer",
    "PRINCIPAL SOFTWARE ENGINEER":"Principal Software Engineer",
    "LEAD SOFTWARE ENGINEER":"Lead Software Engineer",
    "SOFTWARE ENGINEER 1":"Associate Software Engineer", 
    "SOFTWARE ENGINEER 2":"Software Engineer", 
    "SOFTWARE ENGINEER 3":"Senior Software Engineer",
    "SOFTWARE ENGINEER I":"Associate Software Engineer",
    "SOFTWARE ENGINEER II":"Software Engineer",
    "SOFTWARE ENGINEER III":"Senior Software Engineer"
}

In [10]:
se['title'] = se['title'].map(se_title_map)

In [11]:
se.title.unique()

array(['Junior Software Engineer', 'Associate Software Engineer',
       'Software Engineer', 'Senior Software Engineer',
       'Staff Software Engineer', 'Principal Software Engineer',
       'Lead Software Engineer'], dtype=object)

In [12]:
da.title.unique()

array(['JUNIOR DATA ANALYST', 'ASSOCIATE DATA ANALYST', 'DATA ANALYST',
       'STAFF DATA ANALYST', 'SENIOR DATA ANALYST',
       'PRINCIPAL DATA ANALYST', 'LEAD DATA ANALYST', 'DATA ANALYST 2',
       'DATA ANALYST I', 'DATA ANALYST II', 'DATA ANALYST III',
       'DATA ANALYST 1', 'DATA ANALYST 3'], dtype=object)

In [13]:
da_title_map = {
    'JUNIOR DATA ANALYST':'Junior Data Analyst',
    'ASSOCIATE DATA ANALYST':'Associate Data Analyst',
    'DATA ANALYST':'Data Analyst',
    'SENIOR DATA ANALYST':'Senior Data Analyst',
    'STAFF DATA ANALYST':'Staff Data Analyst',
    'PRINCIPAL DATA ANALYST':'Principal Data Analyst',
    'LEAD DATA ANALYST':'Lead Data Analyst',
    'DATA ANALYST 1':'Associate Data Analyst', 
    'DATA ANALYST 2':'Data Analyst', 
    'DATA ANALYST 3':'Senior Data Analyst',
    'DATA ANALYST I':'Associate Data Analyst',
    'DATA ANALYST II':'Data Analyst',
    'DATA ANALYST III':'Senior Data Analyst'
}

In [14]:
da['title'] = da['title'].map(da_title_map)

In [15]:
ds.head()

,employer,title,salary,submitDate,startDate,caseStatus,city,state,submitMonth,startMonth,submitYear,startYear
0,AMERICAN INSTITUTES FOR RESEARCH,Associate Data Scientist,43181,2015-09-29,2015-11-01,CERTIFIED,ROCKVILLE,MD,9,11,2015,2015
1,MIKAN ASSOCIATES LLC,Associate Data Scientist,50190,2015-03-16,2015-09-06,CERTIFIED,CHICAGO,IL,3,9,2015,2015
2,BINARY GROUP INC,Associate Data Scientist,55000,2015-03-11,2015-09-10,WITHDRAWN,ARLINGTON,VA,3,9,2015,2015
3,BINARY GROUP INC,Associate Data Scientist,55000,2015-03-11,2015-09-10,DENIED,ARLINGTON,VA,3,9,2015,2015
4,BINARY GROUP INC,Associate Data Scientist,55000,2015-03-18,2015-09-10,CERTIFIED,ARLINGTON,VA,3,9,2015,2015

In [16]:
month_map = {
    1:'Jan',
    2:'Feb',
    3:'Mar',
    4:'Apr',
    5:'May',
    6:'Jun',
    7:'Jul',
    8:'Aug',
    9:'Sep',
    10:'Oct',
    11:'Nov',
    12:'Dec'
}

In [17]:
ds['submitMonth'] = ds['submitMonth'].map(month_map)
ds['startMonth'] = ds['startMonth'].map(month_map)

se['submitMonth'] = se['submitMonth'].map(month_map)
se['startMonth'] = se['startMonth'].map(month_map)

da['submitMonth'] = da['submitMonth'].map(month_map)
da['startMonth'] = da['startMonth'].map(month_map)

In [18]:
ds.head()

,employer,title,salary,submitDate,startDate,caseStatus,city,state,submitMonth,startMonth,submitYear,startYear
0,AMERICAN INSTITUTES FOR RESEARCH,Associate Data Scientist,43181,2015-09-29,2015-11-01,CERTIFIED,ROCKVILLE,MD,Sep,Nov,2015,2015
1,MIKAN ASSOCIATES LLC,Associate Data Scientist,50190,2015-03-16,2015-09-06,CERTIFIED,CHICAGO,IL,Mar,Sep,2015,2015
2,BINARY GROUP INC,Associate Data Scientist,55000,2015-03-11,2015-09-10,WITHDRAWN,ARLINGTON,VA,Mar,Sep,2015,2015
3,BINARY GROUP INC,Associate Data Scientist,55000,2015-03-11,2015-09-10,DENIED,ARLINGTON,VA,Mar,Sep,2015,2015
4,BINARY GROUP INC,Associate Data Scientist,55000,2015-03-18,2015-09-10,CERTIFIED,ARLINGTON,VA,Mar,Sep,2015,2015

In [19]:
da.to_csv("h1bDataAnalystCleaned.csv")
ds.to_csv("h1bDataScientistCleaned.csv")
se.to_csv("h1bSoftwareEngineerCleaned.csv")